Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/insurance/insurance.html.txt.tmx
Source language: en
Languages: ga

source: Insurance is a way of protecting yourself from any costs that may arise from damage to your property or your health
ga: Is éard atá san árachas ná slí chun tú féin a chosaint ó aon chostais a fhéadann a bheith bainteach le dochar do do mhaoin nó do do shláinte

source: A premium is the amount of money you pay to an insurance company to have an insurance policy to cover you for all or part of these costs
ga: Is éard atá sna préimheanna seo ná an tsuim airgid a íocann tú le cuideachta árachais chun polasaí árachais a fháil a chuimsíonn tú maidir le hiomlán nó páirt na costais seo

source: Insurance companies assess the risk on a particular policy and then calculate the premium to be charged
ga: Déanann cuideachtaí árachais measúnú maidir leis an riosca a bhaineann le polasaí áirithe agus ríomhann siad an phréimh dá ghearradh

source: You can pay a premium monthly or annually
ga: Is féidir préimh a íoc go míosúil nó go bliantúil

source: The Competition and Consumer Protection Commission (CCPC) has published a range of guides that explain how different types of insurance work
ga: Tá raon treoracha curtha le chéile ag Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí a mhíníonn conas mar a oibríonn cineálacha éagsúla árachais

source: Insurance policies are generally renewed once a year. Coming up to renewal date, you should shop around to see if you are getting the best value for your money
ga: Déantar polasaithe a athnuachan ar bhonn bliantúil go hiondúil, agus ba chóir duit breathnú thart ag an bpointe seo le féachaint an bhfuil tú ag fáil luacha ar do chuid airgid

source: The CCPC has also developed a range of insurance cost surveys that help you find the best value insurance
ga: Tá réimse suirbhéanna costais árachais curtha le chéile freisin ag an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí a chabhróidh leat cuardach thart i gcomhair an árachais is fearr luacha

source: Different policies have different terms and conditions so make sure you know what the terms and conditions of your policy are
ga: Tá téarmaí agus coinníollacha éagsúla ag baint le polasaithe éagsúla, agus ní mór duit a chinntiú go bhfuil na téarmaí agus coinníollacha a bhaineann le do pholasaí ar eolas agat

source: It is important to understand exactly what your insurance policy covers when you buy it
ga: Tá sé tábhachtach mar sin go dtuigeann tú go díreach an méid a chlúdaíonn do pholasaí árachais nuair a cheannaíonn tú é

source: You are not obliged by law to insure your home but if you have a mortgage, most lenders will insist that your house is appropriately insured
ga: Ní chaitheann tú árachas a fháil do do theach de réir an dlí, ach éileoidh an chuid is mó d’iasachtóirí go mbíonn árachas iomchuí ag do theach má bhíonn morgáiste agat leo

source: In general, your insurance should cover contents as well as the structure of your home
ga: Ba cheart go gclúdófaí inneachar chomh maith le struchtúr do thí faoin árachas go hiondúil

source: The CCPC has detailed information on home insurance
ga: Tá eolas mionsonraithe faoin árachas tí ag an CICT

source: When taking out a mortgage, you need to consider how it will be paid off in the event of your death and you will generally be required to take out mortgage protection insurance
ga: Nuair a fhaigheann tú morgáiste, ní mór duit machnamh faoin gcaoi a n-íocfar é dá bhfaighfeá bás agus is iondúil go gcaithfidh tú glacadh le hárachas um chosaint morgáiste

source: You may also consider how to continue repayments if your income falls, due to illness, unemployment or other reasons
ga: D'fhéadfá machnamh freisin faoin gcaoi chun leanúint ar aghaidh le haisíocaíochtaí dá dtitfeadh d’ioncam, de bharr breoiteachta, dífhostaíochta nó ar chúiseanna eile nach iad

source: You can find out more about insurance protection on mortgages
ga: Is féidir leat a thuilleadh a fháil amach faoin gcosaint árachais ar mhorgáistí

source: It is a criminal offence for drivers to drive uninsured on public roads in Ireland
ga: Is cion coiriúil é do thiománaithe tiomáint ar bhóithre poiblí gan árachas a bheith acu

source: You can find out more about motor insurance
ga: Is féidir leat tuilleadh eolais faoi árachas mótair a fháil

source: Health insurance is used to pay for private care in hospital or from various health professionals in hospitals or in their practices
ga: Úsáidtear árachas sláinte i gcomhair cúraim phríobháidigh in ospidéil nó ó ghairmithe sláinte ina gcleachtais

source: There are a number of health insurers in Ireland
ga: Tá roinnt árachóirí sláinte ann in Éirinn

source: You can find out more about health insurance
ga: Is féidir leat tuilleadh eolais a fháil faoin árachas sláinte in Éirinn anseo

source: Travel insurance can cover you if you become ill or have an accident while you are on holidays or travelling
ga: Is féidir le hárachas taistil tú a chumhdach i gcás tinnis nó timpiste agus tú ar saoire nó ag taisteal

source: If you are travelling within the EEA or Switzerland, you should have a European Health Insurance Card which allows you to access health care services
ga: Má bhíonn tú ag taisteal laistigh den LEE nó den Eilvéis, ba chóir go mbeadh An Cárta Eorpach um Árachas Sláinte agat, a ligfidh duit chun rochtain a fháil ar sheirbhísí cúraim shláinte

source: In general, travel insurance should supplement the services available to people with a European Health Insurance Card
ga: Is iondúil go mbeadh an t-árachas sláinte mar fhorlíonadh leis na seirbhísí infhaighte do dhaoine leis an gCárta Eorpach um Árachas Sláinte

source: You can find out more about travel insurance and other health issues when travelling abroad
ga: Is féidir leat léamh anseo faoin árachas taistil agus ceisteanna eile a bhaineann le sláinte agus tú ag taisteal thar lear

source: A life insurance policy provides money for dependants if you die
ga: Cuireann polasaí árachais saoil airgead ar fáil do do chleithiúnaithe i gcás do bháis

source: Life insurance policies are important if you have dependants (such as your spouse, partner or children)
ga: Bíonn polasaithe árachais saoil tábhachtach má bhíonn cleithiúnaithe agat, mar shampla páirtí nó clann

source: If you have any problems with an insurer you should first take this up with the customer service department of the insurer (or your broker/agent if you are using one)
ga: Má bhíonn fadhb ar bith agat le hárachóir ba chóir duit é sin a chur faoi bhráid rannóg seirbhísí custaiméirí an árachóra ar dtús (nó faoi bhráid do bhróicéara/ghníomhaire má úsáideann tú ceann éigin)

source: The Central Bank of Ireland enforces the Consumer Protection Code for financial services providers (including insurers and intermediaries)
ga: Is é Banc Ceannais na hÉireann a chuireann i bhfeidhm An Cód um Chosaint Tomhaltóirí i leith soláthróirí seirbhísí airgeadais (lena n-áirítear árachóirí agus idirghabhálaithe)

source: The code sets out how they deal with their customers
ga: Is sa chód a leagtar amach an chaoi ina bpléann siad lena gcustaiméirí

source: If you are not satisfied with how a financial services provider is dealing with you, or you believe that they are not following the principles or rules of the Code, you should first complain to the provider
ga: Mura mbíonn tú sásta leis an gcaoi ina bpléann soláthróir seirbhísí airgeadais leat, nó má chreideann tú nach gcloíonn siad le prionsabail ná le rialacha an Chóid, ba chóir duit gearán a thabhairt don soláthróir ar dtús

source: Under the Code, financial services providers must have a complaints procedure in place and must handle your complaint speedily, efficiently and fairly
ga: De réir an Chóid, caitheann nós imeachta um ghearáin bheith ag na soláthróirí seirbhísí airgeadais, agus caitheann siad dul i ngleic le do ghearán go gasta, go héifeachtúil agus go cothrom

source: There are detailed rules in the Code about how often a firm should contact you to keep you updated on your complaint
ga: Tá rialacha mionsonraithe sa Chód faoina mhinice agus ar cheart do chuideachta teagmháil a dhéanamh leat chun tú a nuashonrú i leith do ghearáin

source: If you cannot resolve your problem or if you are not satisfied with how your complaint is being handled, you can take your complaint to the Financial Services Ombudsman
ga: Mura féidir leat d’fhadhb a réiteach nó mura mbíonn tú sásta leis an gcaoi a bhfuiltear ag dul i ngleic le do ghearán, is féidir leat do ghearán a thabhairt chun an Ombudsman um Sheirbhísí Airgeadais

source: The Ombudsman is an independent, statutory body that can investigate your complaint
ga: Is comhlacht neamhspleách reachtúil é an tOmbudsman ar féidir leis do ghearán a imscrúdú

source: Insurance Ireland provides consumer information and a free Insurance Information Service (IIS) for members of the public
ga: Soláthraíonn Cónaidhm Árachais na hÉireann eolas do thomhaltóirí agus Seirbhís Eolais Árachais shaor in aisce (SEÁ) do bhaill an phobail

source: The IIS can help you if you want information about insurance, or if you need help in resolving a problem with your insurance company
ga: Is féidir leis an SEÁ cuidiú leat má theastaíonn eolas uaithi faoin árachas, nó má theastaíonn cúnamh uait chun fadhb le do chuideachta árachais a réiteach

source: This service will also investigate complaints that fall outside the scope of the Financial Services Ombudsman
ga: Imscrúdóidh an tseirbhís seo gearáin freisin a thagann lasmuigh de raon feidhme an Ombudsman um Sheirbhísí Airgeadais

source: The Competition and Consumer Protection Commission gives information and advice about making claims and financial complaints
ga: Is é an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí a thugann eolas agus comhairle faoi éilimh a dhéanamh agus faoi ghearáin airgeadais

source: Insurance Confidential is a confidential hotline and website run by Insurance Ireland
ga: Is beolíne agus láithreán gréasáin rúnda é Insurance Confidential arna reáchtáil ag Cónaidhm Árachais na hÉireann

source: If you suspect insurance fraud you can visit the website insuranceconfidential.ie to find out more about reporting suspected fraud or call lo-call 1890 333 333
ga: Má bhíonn tú in amhras faoi chalaois árachais is féidir leat cuairt a thabhairt ar an láithreán gréasáin insuranceconfidential.ie chun a thuilleadh a fháil amach faoi thuairisciú na calaoise amhrasta nó lóghlao a chur ar 1890 333 333
